kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
/*
 * ButterFi — Amazon Sidewalk Firmware
 * Target: Seeed Studio XIAO nRF52840
 * SDK:    nRF Connect SDK (Zephyr RTOS)
 *
 * Architecture:
 *   - Sidewalk BLE handles cloud connectivity
 *   - USB CDC-ACM exposes a simple serial command interface
 *     so the web provisioning tool can read status / push config
 *   - Config is stored in Zephyr NVS (non-volatile storage)
 *   - LED reflects connection state
 */

#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/usb/usb_device.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/data/json.h>
#include <zephyr/fs/nvs.h>
#include <zephyr/storage/flash_map.h>
#include <zephyr/sys/reboot.h>
#include <hal/nrf_clock.h>

#include <string.h>
#include <stdio.h>

/* Guard against the build-flag footgun: BUTTERFI_USB_CONTROL_DEBUG defaults ON
 * and its branch in main() precedes the Sidewalk branch, so a build that sets
 * BUTTERFI_INCLUDE_SIDEWALK=ON but forgets BUTTERFI_USB_CONTROL_DEBUG=OFF
 * silently produces Sidewalk-free firmware that still enumerates over USB. */
#if BUTTERFI_USB_CONTROL_DEBUG && BUTTERFI_INCLUDE_SIDEWALK
#error "Set BUTTERFI_USB_CONTROL_DEBUG=OFF when BUTTERFI_INCLUDE_SIDEWALK=ON; the USB-control-debug branch takes precedence and skips sidewalk_init()."
#endif

#if BUTTERFI_INCLUDE_SIDEWALK
#include <pm_config.h>
#include <zephyr/storage/flash_map.h>

#include <sid_api.h>
#include <sid_error.h>
#include <sid_pal_common_ifc.h>
#include <app_ble_config.h>
#endif

#include "butterfi_config.h"
#include "butterfi_usb.h"

LOG_MODULE_REGISTER(butterfi_main, LOG_LEVEL_INF);

/* ── LED (XIAO nRF52840: RGB on P0.26/P0.30/P0.06) ─────────────────────── */
#define LED_RED_NODE   DT_ALIAS(led0)
#define LED_GREEN_NODE DT_ALIAS(led1)
#define LED_BLUE_NODE  DT_ALIAS(led2)

static const struct gpio_dt_spec led_r = GPIO_DT_SPEC_GET(LED_RED_NODE,   gpios);
static const struct gpio_dt_spec led_g = GPIO_DT_SPEC_GET(LED_GREEN_NODE, gpios);
static const struct gpio_dt_spec led_b = GPIO_DT_SPEC_GET(LED_BLUE_NODE,  gpios);

typedef enum {
    LED_STATE_BOOT,        /* Blue pulse  — booting              */
    LED_STATE_UNPROVISIONED, /* Red slow    — needs provisioning  */
    LED_STATE_CONNECTING,  /* Yellow blink — connecting Sidewalk  */
    LED_STATE_CONNECTED,   /* Green solid  — ready               */
    LED_STATE_SENDING,     /* White flash  — transmitting        */
    LED_STATE_ERROR,       /* Red fast     — fault               */
} led_state_t;

static led_state_t current_led_state = LED_STATE_BOOT;

static void led_set(bool r, bool g, bool b)
{
    /* XIAO LEDs are active-low */
    gpio_pin_set_dt(&led_r, !r);
    gpio_pin_set_dt(&led_g, !g);
    gpio_pin_set_dt(&led_b, !b);
}

/* ── Sidewalk state ─────────────────────────────────────────────────────── */
typedef enum {
    SIDEWALK_STATE_INIT,
    SIDEWALK_STATE_READY,
    SIDEWALK_STATE_NOT_REGISTERED,
    SIDEWALK_STATE_ERROR,
} sidewalk_state_t;

static sidewalk_state_t sidewalk_state = SIDEWALK_STATE_INIT;

#define BUTTERFI_MAX_TRANSFER_CHUNKS 255

static bool usb_ready;
static uint8_t active_request_id;
static bool request_in_flight;
static uint8_t ignored_request_id;
static uint8_t active_total_chunks;
static size_t received_chunk_count;
static uint8_t received_chunk_bitmap[(BUTTERFI_MAX_TRANSFER_CHUNKS + 7) / 8];
static uint8_t current_link_state = BUTTERFI_USB_LINK_UNKNOWN;
static volatile uint8_t host_frame_led_ticks;
static volatile uint8_t usb_tx_ok_led_ticks;
static volatile uint8_t usb_tx_err_led_ticks;
static volatile uint8_t usb_rx_byte_led_ticks;
static volatile uint8_t usb_rx_error_led_ticks;
static struct butterfi_usb_diag_counters last_usb_diag_snapshot;
static volatile uint8_t boot_fingerprint_ticks = 40;

/* One-line boot summary emitted over USB frame 0x87 (empty until populated in
 * main()). Surfaces the actual LFCLK source — if it reads RC while the build
 * configures Xtal/50ppm, the crystal isn't running and the controller is
 * advertising the wrong SCA to the gateway — plus the resolved build flags so
 * a Sidewalk-free build can't masquerade as a live one. */
static char boot_info[80];
static int boot_info_emits_remaining = 20;

static void populate_boot_info(void)
{
    uint32_t lfstat = NRF_CLOCK->LFCLKSTAT;
    uint32_t src = (lfstat & CLOCK_LFCLKSTAT_SRC_Msk) >> CLOCK_LFCLKSTAT_SRC_Pos;
    bool running = (lfstat & CLOCK_LFCLKSTAT_STATE_Msk) != 0U;
    const char *src_str = (src == 0U) ? "RC" : (src == 1U) ? "Xtal"
                        : (src == 2U) ? "Synth" : "?";

    (void)snprintk(boot_info, sizeof(boot_info),
                   "BOOT lfclk=%s,%s SW=%d DBG=%d",
                   src_str, running ? "run" : "STOPPED",
                   (int)BUTTERFI_INCLUDE_SIDEWALK,
                   (int)BUTTERFI_USB_CONTROL_DEBUG);
}

static void set_usb_diag_led(uint8_t *slot)
{
    host_frame_led_ticks = 0;
    usb_tx_ok_led_ticks = 0;
    usb_tx_err_led_ticks = 0;
    usb_rx_byte_led_ticks = 0;
    usb_rx_error_led_ticks = 0;
    *slot = 1;
}

#if BUTTERFI_INCLUDE_SIDEWALK
static struct sid_handle *sid_handle   = NULL;

#define BUTTERFI_SIDEWALK_MSG_QUERY 0x01
#define BUTTERFI_SIDEWALK_MSG_RESEND 0x02
#define BUTTERFI_SIDEWALK_MSG_ACK 0x03
#define BUTTERFI_SIDEWALK_MSG_RESPONSE_CHUNK 0x81
/* Sidewalk BLE caps a single message at 255 bytes; our uplink adds a 2-byte
 * header (type + request id), so the app payload must stay <= 253. A larger
 * value would let the stack reject the message rather than our bounds check. */
#define BUTTERFI_SIDEWALK_UPLINK_MAX_PAYLOAD 253

#define MAX_TIME_SYNC_INTERVALS 4
static uint16_t default_sync_intervals_h[MAX_TIME_SYNC_INTERVALS] = { 2, 4, 8, 12 };
static struct sid_time_sync_config default_time_sync_config = {
    .adaptive_sync_intervals_h = default_sync_intervals_h,
    .num_intervals = ARRAY_SIZE(default_sync_intervals_h),
};

K_SEM_DEFINE(sidewalk_event_sem, 0, 1);

/* Manufacturing-page (Sidewalk credential) write buffer. The UF2 bootloader
 * on this hardware only accepts writes to its single known app region, so
 * mfg_storage cannot be provisioned by merging it into a UF2 (see
 * docs/hardware-validation-checklist.md). Instead the browser writes it here
 * over the already-running USB runtime protocol. */
static uint8_t mfg_write_buffer[PM_MFG_STORAGE_SIZE];
static uint16_t mfg_write_received_len;

static int write_mfg_storage(const uint8_t *data, size_t len)
{
    const struct flash_area *fa;
    int rc;

