kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
    rc = flash_area_open(PM_MFG_STORAGE_ID, &fa);
    if (rc != 0) {
        return rc;
    }

    rc = flash_area_erase(fa, 0, fa->fa_size);
    if (rc == 0) {
        rc = flash_area_write(fa, 0, data, len);
    }

    flash_area_close(fa);
    return rc;
}
#endif

static const char *sidewalk_unavailable_reason(void)
{
    if (sidewalk_state == SIDEWALK_STATE_NOT_REGISTERED) {
        return "sidewalk not registered; missing credential or mobile onboarding";
    }

    return "sidewalk not ready";
}

static void refresh_usb_status(void)
{
    uint8_t device_state = BUTTERFI_USB_DEVICE_STATE_IDLE;

    if (sidewalk_state == SIDEWALK_STATE_ERROR) {
        device_state = BUTTERFI_USB_DEVICE_STATE_ERROR;
    } else if (sidewalk_state == SIDEWALK_STATE_NOT_REGISTERED) {
        device_state = BUTTERFI_USB_DEVICE_STATE_SIDEWALK_NOT_REGISTERED;
    } else if (request_in_flight) {
        device_state = BUTTERFI_USB_DEVICE_STATE_BUSY;
    } else if (sidewalk_state == SIDEWALK_STATE_READY) {
        device_state = BUTTERFI_USB_DEVICE_STATE_SIDEWALK_READY;
    } else if (usb_ready) {
        device_state = BUTTERFI_USB_DEVICE_STATE_SIDEWALK_STARTING;
    }

    butterfi_usb_update_status(device_state,
                               current_link_state,
                               request_in_flight ? active_request_id : 0);
}

static void reset_transfer_state(void)
{
    request_in_flight = false;
    active_request_id = 0;
    active_total_chunks = 0;
    received_chunk_count = 0;
    memset(received_chunk_bitmap, 0, sizeof(received_chunk_bitmap));
    refresh_usb_status();
}

static void start_transfer_state(uint8_t request_id)
{
    active_request_id = request_id;
    request_in_flight = true;
    ignored_request_id = 0;
    active_total_chunks = 0;
    received_chunk_count = 0;
    memset(received_chunk_bitmap, 0, sizeof(received_chunk_bitmap));
    refresh_usb_status();
}

static bool mark_chunk_received(uint8_t chunk_idx)
{
    size_t byte_index = chunk_idx / 8;
    uint8_t bit_mask = BIT(chunk_idx % 8);
    bool already_received = (received_chunk_bitmap[byte_index] & bit_mask) != 0U;

    if (!already_received) {
        received_chunk_bitmap[byte_index] |= bit_mask;
        received_chunk_count++;
    }

    return !already_received;
}

#if BUTTERFI_INCLUDE_SIDEWALK
static sid_error_t send_sidewalk_uplink(uint8_t msg_type,
                                        uint8_t request_id,
                                        const uint8_t *payload,
                                        size_t payload_len)
{
    uint8_t buffer[2 + BUTTERFI_SIDEWALK_UPLINK_MAX_PAYLOAD];
    struct sid_msg_desc desc = {
        .link_type = SID_LINK_TYPE_1,
        .type = SID_MSG_TYPE_NOTIFY,
        .link_mode = SID_LINK_MODE_CLOUD,
        .msg_desc_attr = {
            .tx_attr = {
                .request_ack = false,
                .num_retries = 0,
                .ttl_in_seconds = 30,
                .additional_attr = SID_MSG_DESC_TX_ADDITIONAL_ATTRIBUTES_NONE,
            },
        },
    };
    struct sid_msg msg = {
        .data = buffer,
        .size = 2 + payload_len,
    };

    if (payload_len > BUTTERFI_SIDEWALK_UPLINK_MAX_PAYLOAD) {
        return SID_ERROR_PARAM_OUT_OF_RANGE;
    }

    buffer[0] = msg_type;
    buffer[1] = request_id;

    if (payload_len > 0 && payload != NULL) {
        memcpy(&buffer[2], payload, payload_len);
    }

    return sid_put_msg(sid_handle, &msg, &desc);
}
#endif

static void note_host_frame_seen(uint8_t frame_type, uint8_t request_id)
{
    set_usb_diag_led((uint8_t *)&host_frame_led_ticks);
    LOG_INF("USB host frame: type=0x%02x id=%u", frame_type, request_id);
}

struct butterfi_host_config_json {
    char school_id[BUTTERFI_SCHOOL_ID_MAX];
    char device_name[BUTTERFI_DEVICE_NAME_MAX];
    char content_pkg[BUTTERFI_CONTENT_PKG_MAX];
};

static const struct json_obj_descr butterfi_host_config_descr[] = {
    JSON_OBJ_DESCR_PRIM(struct butterfi_host_config_json, school_id, JSON_TOK_STRING_BUF),
    JSON_OBJ_DESCR_PRIM(struct butterfi_host_config_json, device_name, JSON_TOK_STRING_BUF),
    JSON_OBJ_DESCR_PRIM(struct butterfi_host_config_json, content_pkg, JSON_TOK_STRING_BUF),
};

static int save_host_config_payload(const uint8_t *payload, uint16_t payload_len)
{
    char json_buffer[513];
    struct butterfi_host_config_json host_cfg = { 0 };
    butterfi_config_t cfg = { 0 };
    int64_t decoded;

    if (payload == NULL || payload_len == 0 || payload_len >= sizeof(json_buffer)) {
        return -EMSGSIZE;
    }

    memcpy(json_buffer, payload, payload_len);
    json_buffer[payload_len] = '\0';

    decoded = json_obj_parse(json_buffer,
                             payload_len,
                             butterfi_host_config_descr,
                             ARRAY_SIZE(butterfi_host_config_descr),
                             &host_cfg);
    if (decoded < 0) {
        return (int)decoded;
    }

    if ((decoded & (BIT(0) | BIT(2))) != (BIT(0) | BIT(2))) {
        return -EINVAL;
    }

    if (host_cfg.school_id[0] == '\0' || host_cfg.content_pkg[0] == '\0') {
        return -EINVAL;
    }

    strncpy(cfg.school_id, host_cfg.school_id, sizeof(cfg.school_id) - 1);
    strncpy(cfg.content_pkg, host_cfg.content_pkg, sizeof(cfg.content_pkg) - 1);

    if (host_cfg.device_name[0] != '\0') {
        strncpy(cfg.device_name, host_cfg.device_name, sizeof(cfg.device_name) - 1);
    } else {
        strncpy(cfg.device_name, "ButterFi-Dongle", sizeof(cfg.device_name) - 1);
    }

    return butterfi_config_save(&cfg);
}

static void note_usb_tx_result(int ret, const char *label)
{
    if (ret == 0) {
        set_usb_diag_led((uint8_t *)&usb_tx_ok_led_ticks);
        LOG_INF("USB TX ok: %s", label);
    } else {
        set_usb_diag_led((uint8_t *)&usb_tx_err_led_ticks);
        LOG_WRN("USB TX failed (%d): %s", ret, label);
    }
}

static void poll_usb_diag_counters(void)
{
    struct butterfi_usb_diag_counters diag;

    butterfi_usb_get_diag_counters(&diag);

