kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
    if (diag.rx_bytes != last_usb_diag_snapshot.rx_bytes) {
        set_usb_diag_led((uint8_t *)&usb_rx_byte_led_ticks);
    }

    if (diag.rx_errors != last_usb_diag_snapshot.rx_errors) {
        set_usb_diag_led((uint8_t *)&usb_rx_error_led_ticks);
    }

    last_usb_diag_snapshot = diag;
}

static void handle_host_frame(uint8_t frame_type,
                              uint8_t request_id,
                              const uint8_t *payload,
                              uint16_t payload_len,
                              void *context)
{
#if BUTTERFI_INCLUDE_SIDEWALK
    sid_error_t sid_err;
#endif

    ARG_UNUSED(context);

    note_host_frame_seen(frame_type, request_id);

    switch (frame_type) {
    case BUTTERFI_USB_FRAME_HOST_STATUS_REQUEST:
        note_usb_tx_result(butterfi_usb_send_status(), "status");
        break;

    case BUTTERFI_USB_FRAME_HOST_CONFIG_SAVE: {
        int ret = save_host_config_payload(payload, payload_len);

        if (ret < 0) {
            uint8_t error_code = (ret == -EINVAL || ret == -EMSGSIZE)
                ? BUTTERFI_USB_ERROR_INVALID_HOST_FRAME
                : BUTTERFI_USB_ERROR_CONFIG_SAVE_FAILED;
            const char *message = (ret == -EINVAL || ret == -EMSGSIZE)
                ? "invalid config payload"
                : "config save failed";

            LOG_ERR("Config save failed: %d", ret);
            (void)butterfi_usb_send_transfer_error(request_id, error_code, message);
            break;
        }

        note_usb_tx_result(butterfi_usb_send_config_saved(request_id, "config saved"),
                           "config-saved");
        break;
    }

    case BUTTERFI_USB_FRAME_HOST_MFG_WRITE: {
#if BUTTERFI_INCLUDE_SIDEWALK
        uint16_t chunk_offset;
        uint16_t total_len;
        uint16_t chunk_len;

        if (payload_len < 4) {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_INVALID_HOST_FRAME,
                                                   "mfg write frame too short");
            break;
        }

        chunk_offset = payload[0] | (payload[1] << 8);
        total_len = payload[2] | (payload[3] << 8);
        chunk_len = payload_len - 4;

        if (chunk_offset == 0) {
            mfg_write_received_len = 0;
        }

        if (total_len == 0 || total_len > sizeof(mfg_write_buffer) ||
            chunk_offset != mfg_write_received_len ||
            (uint32_t)chunk_offset + chunk_len > total_len) {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_INVALID_HOST_FRAME,
                                                   "mfg write out of sequence");
            mfg_write_received_len = 0;
            break;
        }

        memcpy(&mfg_write_buffer[chunk_offset], &payload[4], chunk_len);
        mfg_write_received_len += chunk_len;

        if (mfg_write_received_len < total_len) {
            (void)butterfi_usb_send_uplink_accepted(request_id);
            break;
        }

        mfg_write_received_len = 0;

        if (write_mfg_storage(mfg_write_buffer, total_len) != 0) {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_MFG_WRITE_FAILED,
                                                   "flash write failed");
            break;
        }

        (void)butterfi_usb_send_mfg_write_ok(request_id, "mfg storage written");
        LOG_INF("Sidewalk mfg_storage written (%u bytes); rebooting", total_len);
        /* USB TX is asynchronous (drains from a ring buffer via UART IRQ),
         * so give the ok frame above time to actually go out over the wire
         * before resetting - otherwise the host never sees it. */
        k_msleep(150);
        sys_reboot(SYS_REBOOT_COLD);
        break;
#else
        (void)butterfi_usb_send_transfer_error(request_id,
                                               BUTTERFI_USB_ERROR_SIDEWALK_UNAVAILABLE,
                                               "sidewalk not built in");
        break;
#endif
    }

    case BUTTERFI_USB_FRAME_HOST_PING:
        note_usb_tx_result(butterfi_usb_send_pong(request_id, payload, payload_len), "pong");
        break;

    case BUTTERFI_USB_FRAME_HOST_QUERY_SUBMIT:
#if BUTTERFI_USB_CONTROL_DEBUG || !BUTTERFI_INCLUDE_SIDEWALK
        (void)butterfi_usb_send_transfer_error(request_id,
                                               BUTTERFI_USB_ERROR_SIDEWALK_UNAVAILABLE,
                                               "usb control debug build");
        break;
#else
        if (payload_len == 0) {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_PROTOCOL_MISMATCH,
                                                   "query payload required");
            break;
        }

        if (request_in_flight) {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_DEVICE_BUSY,
                                                   "request already active");
            break;
        }

        if (sidewalk_state != SIDEWALK_STATE_READY || sid_handle == NULL) {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_SIDEWALK_UNAVAILABLE,
                                                   sidewalk_unavailable_reason());
            break;
        }

        sid_err = send_sidewalk_uplink(BUTTERFI_SIDEWALK_MSG_QUERY,
                                       request_id,
                                       payload,
                                       payload_len);
        if (sid_err != SID_ERROR_NONE) {
            LOG_ERR("Query uplink failed: %d", sid_err);
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_CLOUD_FETCH_FAILED,
                                                   "query uplink failed");
            break;
        }

        start_transfer_state(request_id);
        current_led_state = LED_STATE_SENDING;
        (void)butterfi_usb_send_uplink_accepted(request_id);
        break;
#endif

