kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
K_THREAD_DEFINE(led_tid, LED_STACK_SIZE,
                led_thread_fn, NULL, NULL, NULL,
                LED_PRIORITY, 0, 0);

/* ── USB service thread ─────────────────────────────────────────────────── */
/* 1024 overflowed: the 0x06 config-save path alone puts json_buffer[513] +
 * config structs + the NVS/flash driver + send_frame's frame[~519] on this
 * thread's stack (>2KB), and the query path adds a ~255-byte uplink buffer.
 * With CONFIG_HW_STACK_PROTECTION that overflow was a clean fault, and with no
 * log backend it looked like a silent hang. */
#define USB_STACK_SIZE 4096
#define USB_PRIORITY   -1

static void usb_thread_fn(void *a, void *b, void *c)
{
    int64_t next_usb_status_ms = 0;

    ARG_UNUSED(a);
    ARG_UNUSED(b);
    ARG_UNUSED(c);

    while (1) {
        if (usb_ready) {
            butterfi_usb_poll();
            poll_usb_diag_counters();

            if (k_uptime_get() >= next_usb_status_ms) {
                (void)butterfi_usb_send_status();
                /* Emit the boot summary only for the first ~20s so a watcher
                 * that attaches shortly after boot still catches it, without
                 * flooding the debug channel during later protocol tests. */
                if (boot_info[0] != '\0' && boot_info_emits_remaining > 0) {
                    (void)butterfi_usb_send_debug_text(boot_info);
                    boot_info_emits_remaining--;
                }
                next_usb_status_ms = k_uptime_get() + 1000;
            }
        }

        k_msleep(20);
    }
}

K_THREAD_DEFINE(usb_tid, USB_STACK_SIZE,
                usb_thread_fn, NULL, NULL, NULL,
                USB_PRIORITY, 0, 0);

static void run_usb_control_loop(void)
{
    while (1) {
        if (usb_ready) {
            butterfi_usb_poll();
            poll_usb_diag_counters();
        }

        k_msleep(50);
    }
}

/* ── Main ───────────────────────────────────────────────────────────────── */
int main(void)
{
    int ret;

    LOG_INF("ButterFi v%s starting", BUTTERFI_VERSION);

    /* Load config from NVS — school ID, content package, etc. */
    ret = butterfi_config_load();
    if (ret < 0) {
        LOG_WRN("No config found — device needs provisioning");
        current_led_state = LED_STATE_UNPROVISIONED;
    } else {
        LOG_INF("Config loaded: school=%s pkg=%s",
                butterfi_config_get_school_id(),
                butterfi_config_get_content_pkg());
    }

    /* USB CDC-ACM for provisioning tool comms */
    ret = butterfi_usb_init(handle_host_frame, NULL);
    if (ret < 0) {
        LOG_ERR("USB init failed: %d", ret);
    } else {
        usb_ready = true;
        refresh_usb_status();
    }

    /* Capture the actual LFCLK source + build flags now, for the 0x87 boot
     * summary the USB thread emits (see populate_boot_info). */
    populate_boot_info();

#if BUTTERFI_USB_CONTROL_DEBUG
    LOG_WRN("USB control debug build active - Sidewalk startup skipped");
    sidewalk_state = SIDEWALK_STATE_NOT_REGISTERED;
    current_led_state = LED_STATE_UNPROVISIONED;
    refresh_usb_status();

    run_usb_control_loop();
#elif BUTTERFI_INCLUDE_SIDEWALK
    /* Sidewalk stack */
    ret = sidewalk_init();
    if (ret < 0) {
        current_led_state = LED_STATE_ERROR;
        refresh_usb_status();
        LOG_ERR("Sidewalk init failed — halting");
        return ret;
    }

    current_led_state = LED_STATE_CONNECTING;
    refresh_usb_status();

    /* Main event loop — Sidewalk is event-driven */
    while (1) {
        if (usb_ready) {
            butterfi_usb_poll();
            poll_usb_diag_counters();
        }

        (void)k_sem_take(&sidewalk_event_sem, K_MSEC(100));

        if (sid_handle != NULL) {
            sid_error_t err = sid_process(sid_handle);
            if (err != SID_ERROR_NONE) {
                LOG_ERR("sid_process error: %d", err);
            }
        }
    }
#else
    LOG_WRN("Sidewalk excluded from build");
    sidewalk_state = SIDEWALK_STATE_NOT_REGISTERED;
    current_led_state = LED_STATE_UNPROVISIONED;
    refresh_usb_status();
    run_usb_control_loop();
#endif

    return 0;
}
